Tekla Open API Reference for Tekla Structures 2025
AnalysisRestraintData.SupportedEnum Enumeration
 Defines how the part is supported.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum SupportedEnum
Public Enumeration SupportedEnum
Members
Member name | Value | Description
CONNECTED | 0 |  The part is connected.
SUPPORTED | 1 |  The part is supported.
See Also
Reference
Tekla.Structures.Analysis Namespace